
# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [2,2,  2,4,  5,4]  # P3/8
  - [3,4,  4,8,  9,6]  # P3/8
  - [5,7,  8,15,  17,12]  # P3/8
  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, BottleneckCSP, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 9, BottleneckCSP, [1024]], #8
   [-1, 1, Conv, [2048, 3, 2]],  # 9-P5/32
   [-1, 1, SPP, [2048, [5, 9, 13]]],#10
   [-1, 3, BottleneckCSP, [2048, False]],  # 11
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [1024, 1, 1]], #12
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #13
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4 14
   [-1, 3, BottleneckCSP, [1024, False]],  # 15

   [-1, 1, Conv, [512, 1, 1]], #16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #17
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4 #18
   [-1, 3, BottleneckCSP, [512, False]],  # 13 #19

   [-1, 1, Conv, [256, 1, 1]], #20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #21
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3 #22
   [-1, 3, BottleneckCSP, [256, False]],  # 17 (P3/8-small) #23

   [-1, 1, Conv, [256, 3, 2]], #24
   [[-1,20 ], 1, Concat, [1]],  # cat head P4 29
   [-1, 3, BottleneckCSP, [256, False]],  # 20 (P4/16-medium) #30

   [-1, 1, Conv, [256, 3, 2]], #27
   [[-1, 16], 1, Concat, [1]],  # cat head P4 #32
   [-1, 3, BottleneckCSP, [512, False]],  # 20 (P4/16-medium) #33

   [-1, 1, Conv, [512, 3, 2]], #30
   [[-1, 12], 1, Concat, [1]],  # cat head P5#35
   [-1, 3, BottleneckCSP, [1024, False]],  # 23 (P5/32-large) #36

   [[17, 26, 29, 32], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
